tap "dwarvesf/tap"
tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "teamookla/speedtest"
brew "bat"
brew "bison"
brew "bison@2.7"
brew "glib"
brew "openssl@1.1"
brew "python@3.9", link: false
brew "cmake", link: false
brew "cmatrix"
brew "fd"
brew "fisher"
brew "fzf"
brew "isl"
brew "mpfr"
brew "gcc"
brew "gcc@8"
brew "gcc@9"
brew "gdk-pixbuf"
brew "git"
brew "tcl-tk"
brew "git-gui"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gobject-introspection"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "htop"
brew "hunspell"
brew "jq"
brew "libass"
brew "libomp", link: true
brew "libproxy"
brew "libssh2"
brew "libxmlsec1"
brew "llvm"
brew "mackup"
brew "neovim"
brew "nmap"
brew "oath-toolkit"
brew "pstree"
brew "qt"
brew "pyqt"
brew "python@3.10"
brew "stow"
brew "telnet"
brew "tmux"
brew "watch"
brew "wget"
brew "xauth"
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", link: false
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
brew "teamookla/speedtest/speedtest"
cask "alt-tab"
cask "amethyst"
cask "android-platform-tools"
cask "cmake"
cask "hammerspoon"
cask "karabiner-elements"
cask "macfuse"
cask "vimmotion"
cask "xquartz"
vscode "076923.python-image-preview"
vscode "aaron-bond.better-comments"
vscode "alefragnani.numbered-bookmarks"
vscode "AlexArthurs.todo-pusher"
vscode "analytic-signal.preview-tiff"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "did1335.opencv-intellisense"
vscode "donjayamanne.githistory"
vscode "DotJoshJohnson.xml"
vscode "eamodio.gitlens"
vscode "formulahendry.code-runner"
vscode "garytyler.darcula-pycharm"
vscode "GitHub.copilot"
vscode "GitHub.remotehub"
vscode "googlecloudtools.cloudcode"
vscode "Gruntfuggly.todo-tree"
vscode "gsGupta.opencv-snippets"
vscode "ionutvmi.path-autocomplete"
vscode "johnguo.simply-view-image-for-python-opencv-debugging"
vscode "kiteco.kite"
vscode "kunalvaidya.vscodextrello"
vscode "lkytal.pomodoro"
vscode "magicstack.MagicPython"
vscode "mhutchie.git-graph"
vscode "moshfeu.compare-folders"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "Percy.vscode-numpy-viewer"
vscode "redhat.vscode-yaml"
vscode "RescueTime.rescuetime"
vscode "ryu1kn.partial-diff"
vscode "shalimski.swapdiff"
vscode "SonarSource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "tatsy.vscode-3d-preview"
vscode "tomoki1207.pdf"
vscode "Tyriar.luna-paint"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "ypresto.vscode-intelli-refactor"
